De la db publications. Saca los authors que han publicado +1 libro e indica cuantos libros se han vendido.

In [7]:
import os
os.environ["GOOGLE_APPLICATION_CREDENTIALS"]="/Users/Miguel/Documents/GitHub/Ironhack exercises/Modulo 1/ironhack_service_account_big_query.json"
from google.cloud import bigquery

In [8]:
client = bigquery.Client()

In [12]:
sql="""
WITH authors_fil AS
(SELECT
  au_id,
  COUNT(DISTINCT title_id) AS titles_vol
FROM
  `ironhack-data-analytics-265219.publications.titleauthor`
GROUP BY 1
HAVING  COUNT(DISTINCT title_id)>1)
    SELECT
      authors.au_fname,
      authors.au_lname,
      SUM(qty) AS total_quantity_sold
    FROM
      authors_fil
    JOIN
      `ironhack-data-analytics-265219.publications.authors` authors
    ON
      authors.au_id = authors_fil.au_id
    JOIN
       `ironhack-data-analytics-265219.publications.titleauthor` titleauthor
    ON
      titleauthor.au_id = authors.au_id
    JOIN
       `ironhack-data-analytics-265219.publications.sales` sales
    ON
      titleauthor.title_id = sales.title_id
    GROUP BY 1,2
    """

In [13]:
query_job_1= client.query(query=sql)

In [14]:
dataframe_1 = query_job_1.to_dataframe()

In [15]:
dataframe_1

   au_fname    au_lname total_quantity_sold
0      Anne      Ringer                 148
1  Marjorie       Green                  50
2   Michael     O'Leary                  45
3   Stearns  MacFeather                  45
4    Albert      Ringer                 133
5  Charlene    Locksley                  25